In [1]:
import pandas as pd

In [2]:
#Criando um dataframe de exemplo
dados = {
    'Categoria': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Subcategoria': ['X', 'X', 'Y', 'Y', 'X', 'Y', 'Y', 'X'],
    'Valor': [10, 15, 10, 15, 10, 15, 10, 15],
    'Quantidade': [1, 2, 3, 4, 5, 6, 7, 8]
}
df = pd.DataFrame(dados)
print("Dataframe de exemplo")
display(df)

Dataframe de exemplo

  Categoria Subcategoria  Valor  Quantidade
0         A            X     10           1
1         B            X     15           2
2         A            Y     10           3
3         B            Y     15           4
4         A            X     10           5
5         B            Y     15           6
6         A            Y     10           7
7         B            X     15           8

In [3]:
df.Valor.describe()

count     8.000000
mean     12.500000
std       2.672612
min      10.000000
25%      10.000000
50%      12.500000
75%      15.000000
max      15.000000
Name: Valor, dtype: float64

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Categoria     8 non-null      object
 1   Subcategoria  8 non-null      object
 2   Valor         8 non-null      int64
 3   Quantidade    8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 388.0+ bytes

In [9]:
df.Categoria.value_counts()

Categoria
A    4
B    4
Name: count, dtype: int64

Agrupando por um único índice

In [10]:
#Agrupando por 'Categoria' e calculando a soma
grupo_categoria = df.groupby('Categoria').sum(numeric_only=True)
print("Agrupamento por 'Categoria':")
display(grupo_categoria)

Agrupamento por 'Categoria':

           Valor  Quantidade
Categoria
A             40          16
B             60          20

Aplicando múltiplas funções de agregação

In [11]:
#Agrupando por 'Categoria' e calculando a soma e a média
grupo_categoria_agregacoes = df.groupby('Categoria').agg({'Valor': 'sum', 'Quantidade': 'mean'})
print("Agrupamento por 'Categoria' com múltiplas funções de agregação:")
display(grupo_categoria_agregacoes)

Agrupamento por 'Categoria' com múltiplas funções de agregação:

           Valor  Quantidade
Categoria
A             40         4.0
B             60         5.0

Agrupando por múltiplos índices

In [12]:
#Agrupando por 'Categoria' e 'Subcategoria' e calculando a soma
grupo_multiplos_indices = df.groupby(['Categoria', 'Subcategoria']).sum()
print("Agrupamento por 'Categoria' e 'Subcategoria':")
display(grupo_multiplos_indices)

Agrupamento por 'Categoria' e 'Subcategoria':

                        Valor  Quantidade
Categoria Subcategoria
A         X                20           6
          Y                20          10
B         X                30          10
          Y                30          10

Utilizando métodos específicos para agrupamento

In [14]:
#Agrupando por categoria e calculando a média
media_categoria = df.groupby('Categoria').mean(numeric_only=True)
print("Média por 'Categoria':")
display(media_categoria)

Média por 'Categoria':

           Valor  Quantidade
Categoria
A           10.0         4.0
B           15.0         5.0

Métodos de agregação: mean(), count(), min(), max(), entre outros.

In [18]:
#Agrupando por 'Categoria' e contando as ocorrências
contagem_categoria = df.groupby('Categoria').count()
print("Contagem por 'Categoria':")
display(contagem_categoria)

Contagem por 'Categoria':

           Subcategoria  Valor  Quantidade
Categoria
A                     4      4           4
B                     4      4           4

Filtrando grupos

In [19]:
#Filtrando grupos onde a soma da 'Quantidade' é maior que 10
filtrado = df.groupby('Categoria').filter(lambda x: x['Quantidade'].sum() > 10)
print("Grupos onde a soma da 'Quantidade' é maior que 10:")
display(filtrado)

Grupos onde a soma da 'Quantidade' é maior que 10:

  Categoria Subcategoria  Valor  Quantidade
0         A            X     10           1
1         B            X     15           2
2         A            Y     10           3
3         B            Y     15           4
4         A            X     10           5
5         B            Y     15           6
6         A            Y     10           7
7         B            X     15           8

Ordenação dos dados

In [20]:
dados2 = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Diana', 'Eduardo'],
    'Idade': [23, 34, 45, 29, 40],
    'Nota': [85, 90, 78, 92, 88]
}
df2 = pd.DataFrame(dados2)
print("Dataframe de exemplo")
display(df2)

Dataframe de exemplo

      Nome  Idade  Nota
0      Ana     23    85
1    Bruno     34    90
2   Carlos     45    78
3    Diana     29    92
4  Eduardo     40    88

In [22]:
df2.Nota.max()

92

In [46]:
df2.loc[df2.Nota.idxmax(), 'Nome']

'Diana'

Ordenando por uma coluna

In [29]:
#Ordenando por 'Nota' em ordem ascendente
df2_ordenado = df2.sort_values(by='Nota')
print("Ordenando por 'Nota' em ordem crescente:")
display(df2_ordenado)

Ordenando por 'Nota' em ordem crescente:

      Nome  Idade  Nota
2   Carlos     45    78
0      Ana     23    85
4  Eduardo     40    88
1    Bruno     34    90
3    Diana     29    92

In [50]:
df2_ordenado2 = df2.Nota.sort_values(ascending=False)
df2_ordenado2

3    92
1    90
4    88
0    85
2    78
Name: Nota, dtype: int64

Ordem decrescente

In [30]:
df2_ordenado_decrescente = df2.sort_values(by='Nota', ascending=False)
print("Ordenando por 'Nota' em ordem decrescente:")
display(df2_ordenado_decrescente)

Ordenando por 'Nota' em ordem decrescente:

      Nome  Idade  Nota
3    Diana     29    92
1    Bruno     34    90
4  Eduardo     40    88
0      Ana     23    85
2   Carlos     45    78

Ordenando por múltiplas colunas

In [34]:
df2['Turma'] = ['A', 'A', 'B', 'B', 'A']
print("Dataframe de exemplo com coluna 'Turma' incluída")
display(df2)

Dataframe de exemplo com coluna 'Turma' incluída

      Nome  Idade  Nota Turma
0      Ana     23    85     A
1    Bruno     34    90     A
2   Carlos     45    78     B
3    Diana     29    92     B
4  Eduardo     40    88     A

In [35]:
#Ordenando por 'Turma' e depois por 'Nota'
df2_ordenacao_multipla = df2.sort_values(by=['Turma', 'Nota'])
print("Ordenando por 'Turma' e 'Nota'")
display(df2_ordenacao_multipla)

Ordenando por 'Turma' e 'Nota'

      Nome  Idade  Nota Turma
0      Ana     23    85     A
4  Eduardo     40    88     A
1    Bruno     34    90     A
2   Carlos     45    78     B
3    Diana     29    92     B

In [42]:
#Note a ordem dos índices após a ordenação 
df2_ordenado = df2.sort_values(by='Nota')
display(df2_ordenado)
print("Para alterar a ordem dos indices devemos usar o parâmetro ignore_index=True")
df2_ordenado = df2.sort_values(by='Nota', ignore_index=True)
display(df2_ordenado)
print("ignore_index=True: Redefine os índices após a ordenação.")

      Nome  Idade  Nota Turma
2   Carlos     45    78     B
0      Ana     23    85     A
4  Eduardo     40    88     A
1    Bruno     34    90     A
3    Diana     29    92     B

Para alterar a ordem dos indices devemos usar o parâmetro ignore_index=True

      Nome  Idade  Nota Turma
0   Carlos     45    78     B
1      Ana     23    85     A
2  Eduardo     40    88     A
3    Bruno     34    90     A
4    Diana     29    92     B

ignore_index=True: Redefine os índices após a ordenação.

Ordenando por índices

In [43]:
#Criando um dataframe com índices desordenados
df2_desordenado = df2.sample(frac=1).reset_index(drop=True)
print("Dataframe desordenado")
display(df2_desordenado)

Dataframe desordenado

      Nome  Idade  Nota Turma
0   Carlos     45    78     B
1      Ana     23    85     A
2    Diana     29    92     B
3  Eduardo     40    88     A
4    Bruno     34    90     A

In [45]:
df2_ordenado_indice = df2_desordenado.sort_index()
print("Ordenando por índice:")
display(df2_ordenado_indice)

Ordenando por índice:

      Nome  Idade  Nota Turma
0   Carlos     45    78     B
1      Ana     23    85     A
2    Diana     29    92     B
3  Eduardo     40    88     A
4    Bruno     34    90     A